; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	spectrograph2 - mode
	infrared4 - mode
	image1 - mode
	thermograph3 - mode
	infrared0 - mode
	Star1 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph2)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star7)
	(supports instrument5 infrared4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument6 infrared0)
	(supports instrument6 infrared4)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image1)
	(supports instrument7 thermograph3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 infrared0)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation6)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument9 infrared4)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument10 infrared4)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 GroundStation3)
	(supports instrument11 infrared0)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 GroundStation6)
	(supports instrument12 spectrograph2)
	(supports instrument12 thermograph3)
	(calibration_target instrument12 GroundStation6)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
	(supports instrument13 spectrograph2)
	(supports instrument13 infrared0)
	(supports instrument13 thermograph3)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 thermograph3)
	(calibration_target instrument14 GroundStation4)
	(supports instrument15 thermograph3)
	(supports instrument15 image1)
	(supports instrument15 infrared4)
	(calibration_target instrument15 GroundStation3)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(on_board instrument15 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon8)
)
(:goal (and
	(pointing satellite3 Star1)
	(pointing satellite4 GroundStation5)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 image1)
	(have_image Phenomenon11 thermograph3)
	(have_image Phenomenon12 spectrograph2)
	(have_image Planet13 infrared4)
))

)

; plan
1. (turn_to satellite5 groundstation3 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument15 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument15)
   goals met: 0 of 8
3. (calibrate satellite5 instrument15 groundstation3)
   added: (calibrated instrument15)
   goals met: 0 of 8
4. (turn_to satellite5 planet10 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 planet10)
   goals met: 0 of 8
5. (take_image satellite5 planet10 instrument15 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 8
6. (turn_to satellite5 phenomenon8 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 phenomenon8)
   goals met: 1 of 8
7. (take_image satellite5 phenomenon8 instrument15 image1)
   added: (have_image phenomenon8 image1)
   goals met: 2 of 8
8. (turn_to satellite5 phenomenon11 phenomenon8)
   deleted: (pointing satellite5 phenomenon8)
   added: (pointing satellite5 phenomenon11)
   goals met: 2 of 8
9. (turn_to satellite3 star1 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 star1)
   goals met: 3 of 8
10. (turn_to satellite0 groundstation0 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 8
11. (take_image satellite5 phenomenon11 instrument15 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 4 of 8
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
13. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 8
14. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 8
15. (take_image satellite0 phenomenon12 instrument0 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 5 of 8
16. (turn_to satellite0 phenomenon9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 8
17. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 6 of 8
18. (turn_to satellite4 groundstation5 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 groundstation5)
   goals met: 7 of 8
19. (turn_to satellite5 planet13 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet13)
   goals met: 7 of 8
20. (take_image satellite5 planet13 instrument15 infrared4)
   added: (have_image planet13 infrared4)
   goals met: 8 of 8
